class UpdateStateAndCity < ActiveRecord::Migration
  #state 和 cities表的ID不是 自增长型
  def self.up
    create_table :states,:force =>true do |t|
      t.string :name,:limit=>32
    end
    create_table :cities ,:force =>true do |t|
      t.integer :state_id,:null=>false
      t.string :name,:limit=>32
    end
 
     
    states = [["北京",%(
        东城区,西城区,崇文区,宣武区,朝阳区,丰台区,石景山区,海淀区,门头沟区,房山区,
通州区,顺义区,昌平区,大兴区,怀柔区,平谷区,密云县,延庆县)],
      ["上海",%(
        黄浦区,卢湾区,徐汇区,长宁区,静安区,普陀区,闸北区,虹口区,杨浦区,闵行区,宝山区,
嘉定区,浦东新区,金山区,松江区,青浦区,南汇区,奉贤区,崇明县)],
      ["天津",%(
        和平区,河东区,河西区,南开区,河北区,红桥区,塘沽区,汉沽区,大港区,东丽区,西青区,
津南区,北辰区,武清区,宝坻区,宁河县,静海县,蓟县)],
      ["重庆",%(万州区,涪陵区,渝中区,大渡口区,江北区,沙坪坝区,九龙坡区,南岸区,北碚区,
万盛区,双桥区,渝北区,巴南区,黔江区,长寿区,綦江县,潼南县,铜梁县,大足县,荣昌县,璧山县,
梁平县,城口县,丰都县,垫江县,武隆县,忠县,开县,云阳县,奉节县,巫山县,巫溪县,石柱土家族自治县,
秀山土家族苗族自治县,酉阳土家族苗族自治县,彭水苗族土家族自治县,江津市,合川市,永川市,南川市)],
      ["江苏",%(南京,无锡,徐州,常州,苏州,南通,连云港,淮安,盐城,扬州,镇江,泰州,宿迁)],
      ["浙江",%[杭州,宁波,温州,嘉兴,湖州,绍兴,金华,衢州,舟山,台州,丽水]],
      ["安徽",%[合肥,芜湖,蚌埠,淮南,马鞍山,淮北,铜陵,安庆,黄山,滁州,阜阳,宿州,巢湖,六安,亳州]],
      ["四川",%[成都,自贡,攀枝花,泸州,德阳,绵阳,广元,遂宁,内江,乐山,南充,宜宾,广安,
达州,眉山,雅安,巴中,资阳,阿坝藏族,甘孜藏族,凉山彝族]],
      ["福建",%[福州,厦门,莆田,三明,泉州,漳州,南平,龙岩,宁德]],
      ["江西",%[南昌,景德镇,萍乡,新余,九江,鹰潭,赣州,吉安,宜春,抚州,上饶]],
      ["山东",%[济南,青岛,淄博,枣庄,东营,潍坊,烟台,威海,济宁,泰安,日照,莱芜,
德州,临沂,聊城,滨州,菏泽]],
      ["河南",%[郑州,开封,洛阳,平顶山,焦作,鹤壁,新乡,安阳,濮阳,许昌,漯河,三门峡,
南阳,商丘,信阳,周口,驻马店,济源]],
      ["湖北",%[武汉,黄石,襄樊,十堰,荆州,宜昌,荆门,鄂州,孝感,黄冈,咸宁,随州,仙桃,
天门,潜江,神农架,恩施土家]],
      ["湖南",%[长沙,株洲,湘潭,衡阳,邵阳,岳阳,常德,张家界,益阳,郴州,怀化,娄底,湘西土家,
永州]],
      ["广东",%[广州,深圳,珠海,汕头,韶关,佛山,江门,湛江,茂名,肇庆,惠州,梅州,汕尾,
河源,阳江,清远,东莞,中山,潮州,揭阳,云浮]],
      ["河北",%[石家庄,唐山,秦皇岛,邯郸,邢台,保定,张家口,承德,沧州,廊坊,衡水]],
      ["山西",%[太原,大同,阳泉,长治,晋城,朔州,晋中,运城,忻州,临汾,
吕梁]],
      ["内蒙古",%[呼和浩特,包头,乌海,赤峰,通辽,鄂尔多斯,呼伦贝尔,乌兰察布,锡林郭勒盟,
巴彦淖尔,阿拉善盟,兴安盟]],
      ["辽宁",%[沈阳,大连,鞍山,抚顺,本溪,丹东,锦州,葫芦岛,营口,盘锦,阜新,辽阳,铁岭,朝阳]],
      ["吉林",%[长春,吉林,四平,辽源,通化,白山,松原,白城,延边朝鲜]],
      ["黑龙江",%[哈尔滨,齐齐哈尔,鹤岗,双鸭山,鸡西,大庆,伊春,牡丹江,佳木斯,七台河,
黑河,绥化,大兴安岭]],
      ["香港",%[香港]],
      ["澳门",%[澳门]],
      ["台湾",%[台北,高雄,基隆,台中,台南,新竹,嘉义,台北县,宜兰县,新竹县,桃园县,
苗栗县,台中县,彰化县,南投县,嘉义县,云林县,台南县,高雄县,屏东县,台东县,花莲县,澎湖县]],
      ["广西",%[南宁,柳州,桂林,梧州,北海,防城港,钦州,贵港,玉林,
百色,贺州,河池,来宾,崇左]],
      ["海南",%[海口,三亚,五指山,琼海,儋州,文昌,万宁,东方,澄迈,定安,屯昌,临高,
白沙黎族,江黎族自,乐东黎族,陵水黎族,保亭黎族,琼中黎族,西沙群岛,南沙群岛,中沙群岛]],
      ["陕西",%[西安,铜川,宝鸡,咸阳,渭南,延安,汉中,榆林,安康,商洛]],

      ["云南",%[昆明,曲靖,玉溪,保山,昭通,丽江,思茅,临沧,文山壮族,红河哈尼,
西双版纳,楚雄彝族,大理白族,德宏傣族,怒江傈傈,迪庆藏族]],
      ["贵州",%[贵阳,六盘水,遵义,安顺,铜仁,毕节,黔西南布,黔东南苗,黔南布依]],
      ["西藏",%[拉萨,那曲,昌都,山南,日喀则,阿里,林芝]],
      ["甘肃",%[兰州,金昌,白银,天水,嘉峪关,武威,张掖,平凉,酒泉,庆阳,定西,
陇南,临夏回族,甘南藏族]],
      ["青海",%[西宁,海东,海北藏族,黄南藏族,海南藏族,果洛藏族,玉树藏族,海西蒙古]],
      ["宁夏",%[银川,石嘴山,吴忠,固原,中卫]],
      ["新疆",%[乌鲁木齐,克拉玛依,石河子,阿拉尔,图木舒克,五家渠,吐鲁番,哈密,和田,
阿克苏,喀什,克孜勒苏,巴音郭楞,昌吉回族,博尔塔拉,伊犁哈萨,塔城,阿勒泰]],
      ["国外",%(美国,日本,英国,法国,德国,加拿大,澳大利亚,俄罗斯,新西兰,
 意大利,韩国,比利时,瑞士,新加坡,墨西哥,荷兰,巴西,印度,
爱尔兰,马来西亚,丹麦,南非,西班牙)]]

    states.each do |state|
      st = State.new(:name=>state[0])
      state[1].split(',').each do |city|
        st.cities << City.new(:name=>city.strip.chomp)
      end
      st.save!
    end
 
  end

  def self.down
    drop_table :states
    drop_table :cities
  end
end
